{
  "saveButtonText": "บันทึก",
  "actions": {
    "updateSuccess": "อัปเดตการตั้งค่าแล้ว",
    "updateFailed": "ไม่สามารถอัปเดตการตั้งค่า"
  },
  "title": "การตั้งค่า",
  "billingFailureSettings": {
    "title": "การพยายามเรียกเก็บเงิน",
    "description": "กำหนดเวลาในการพยายามเรียกเก็บเงินอีกครั้งหลังจากการพยายามก่อนหน้าล้มเหลว",
    "paymentFailureTitle": "วิธีการชำระเงินล้มเหลว",
    "inventoryFailureTitle": "สินค้าคงคลังไม่เพียงพอ",
    "retryAttempts": {
      "label": "จำนวนครั้งในการพยายามใหม่อีกครั้ง",
      "helpText": "จำนวนการลองอีกครั้งต่ำสุด 0 ครั้งและสูงสุด 10 ครั้ง",
      "errors": {
        "min": "จำนวนครั้งในการพยายามใหม่อีกครั้งต้องมากกว่า 0",
        "max": "จำนวนครั้งในการพยายามใหม่อีกครั้งมากเกินไป"
      }
    },
    "daysBetweenRetryAttempts": {
      "label": "จำนวนวันสำหรับการเว้นช่วงในการพยายามเรียกเก็บเงินใหม่อีกครั้ง",
      "helpText": "ต่ำสุด 1 วันและสูงสุด 14 วัน",
      "errors": {
        "min": "จำนวนวันสำหรับการเว้นช่วงในการพยายามเรียกเก็บเงินใหม่อีกครั้งต้องมากกว่า 1",
        "max": "จำนวนวันสำหรับการเว้นช่วงในการพยายามเรียกเก็บเงินใหม่อีกครั้งมากเกินไป"
      }
    },
    "inventoryRetryAttempts": {
      "errors": {
        "min": "จำนวนครั้งในการพยายามตรวจสอบสินค้าคงคลังใหม่อีกครั้งต้องมากกว่า 0",
        "max": "จำนวนครั้งในการพยายามตรวจสอบสินค้าคงคลังใหม่อีกครั้งมากเกินไป"
      }
    },
    "inventoryDaysBetweenRetryAttempts": {
      "errors": {
        "min": "จำนวนวันสำหรับการเว้นช่วงในการพยายามตรวจสอบสินค้าคงคลังใหม่อีกครั้งต้องมากกว่า 1",
        "max": "จำนวนวันสำหรับการเว้นช่วงในการพยายามตรวจสอบสินค้าคงคลังใหม่อีกครั้งมากเกินไป"
      }
    },
    "onFailure": {
      "label": "การดำเนินการเมื่อการพยายามใหม่อีกครั้งทั้งหมดล้มเหลว",
      "options": {
        "skip": "ข้ามคำสั่งซื้อและส่งการแจ้งเตือน",
        "cancel": "ยกเลิกการสมัครใช้งานและส่งการแจ้งเตือน",
        "pause": "หยุดการสมัครใช้งานชั่วคราวและส่งการแจ้งเตือน"
      }
    },
    "notifications": "แก้ไขการแจ้งเตือน",
    "staffNotificationFrequency": {
      "label": "ความถี่ในการส่งการแจ้งเตือนไปยังพนักงาน",
      "options": {
        "immediately": "ทุกครั้งที่การเรียกเก็บเงินล้มเหลว",
        "weekly": "ข้อมูลสรุปรายสัปดาห์เกี่ยวกับการเรียกเก็บเงินที่ล้มเหลว",
        "monthly": "ข้อมูลสรุปรายเดือนเกี่ยวกับการเรียกเก็บเงินที่ล้มเหลว"
      }
    }
  }
}
